//**************************************************
// 
// locus.cpp
// Author  : katsuki mizuki
// 
//**************************************************

//==================================================
// インクルード
//==================================================
#include "locus.h"
#include "application.h"
#include <assert.h>

//--------------------------------------------------
// 生成
//--------------------------------------------------
CLocus* CLocus::Create(const D3DXVECTOR3& start, const D3DXVECTOR3& end)
{
	CLocus* pLocus = nullptr;

	pLocus = new CLocus;

	if (pLocus != nullptr)
	{// nullチェック
		pLocus->Init();
		pLocus->SetMove(start, end);
	}

	return pLocus;
}

//--------------------------------------------------
// デフォルトコンストラクタ
//--------------------------------------------------
CLocus::CLocus()
{
}

//--------------------------------------------------
// デストラクタ
//--------------------------------------------------
CLocus::~CLocus()
{
}

//--------------------------------------------------
// 初期化
//--------------------------------------------------
void CLocus::Init()
{
	// 初期化
	CObject3D::Init();

	// サイズの設定
	CObject3D::SetSize(D3DXVECTOR3(30.0f, (float)CApplication::SCREEN_HEIGHT, 0.0f));
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void CLocus::Uninit()
{
	// 終了
	CObject3D::Uninit();
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void CLocus::Update()
{
	// 更新
	CObject3D::Update();
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void CLocus::Draw()
{
	// 描画
	CObject3D::Draw();
}

//--------------------------------------------------
// 移動量の設定
//--------------------------------------------------
void CLocus::SetMove(const D3DXVECTOR3& start, const D3DXVECTOR3& end)
{
	
}
