//=============================================================================
//
// 2Dゲージクラス(gauge2D.cpp)
// Author : 唐﨑結斗
// 概要 : 2Dゲージ生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "twin_circle.h"
#include "object2D.h"
#include "renderer.h"
#include "application.h"
#include "utility.h"

//=============================================================================
// インスタンス生成
// Author : 唐﨑結斗
// 概要 : 2Dゲージを生成する
//=============================================================================
CTwinCircle * CTwinCircle::Create(void)
{
	// オブジェクトインスタンス
	CTwinCircle *pTwinCircle = nullptr;

	// メモリの解放
	pTwinCircle = new CTwinCircle;

	if (pTwinCircle != nullptr)
	{// 数値の初期化
		pTwinCircle->Init();
	}
	else
	{// メモリの確保ができなかった
		assert(false);
	}

	// インスタンスを返す
	return pTwinCircle;
}

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CTwinCircle::CTwinCircle(CObject::ECategory cat) : CObject(cat)
{
	pTarget0 = nullptr;									// ターゲット
	pTarget1 = nullptr;									// ターゲット1
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);				// 位置
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);				// 向き
	m_size = D3DXVECTOR3(0.0f, 0.0f, 0.0f);				// 大きさ
	m_moveTarget = D3DXVECTOR3(0.0f, 0.0f, 0.0f);		// ターゲットの移動量
	m_wave = D3DXVECTOR2(0.0f, 0.0f);					// 波
}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CTwinCircle::~CTwinCircle()
{

}

//=============================================================================
// ポリゴンの初期化
// Author : 唐﨑結斗
// 概要 : 頂点バッファを生成し、メンバ変数の初期値を設定
//=============================================================================
void CTwinCircle::Init()
{
	// 配置の初期設定
	m_pos = D3DXVECTOR3(640.0f, 360.0f, 0.0f);			// 位置
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);				// 向き
	m_size = D3DXVECTOR3(200.0f, 200.0f, 0.0f);			// 大きさ
}

//=============================================================================
// ポリゴンの終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CTwinCircle::Uninit()
{

}

//=============================================================================
// ポリゴンの更新
// Author : 唐﨑結斗
// 概要 : 2Dポリゴンの更新を行う
//=============================================================================
void CTwinCircle::Update()
{
	m_wave.x += 0.1f;
	m_wave.y += 0.1f;
	NormalizeAngle(&m_wave.x);
	NormalizeAngle(&m_wave.y);
	m_moveTarget.x = sinf(m_wave.x) * 10.0f;
	m_moveTarget.y = cosf(m_wave.y) * -10.0f;

	// 振り子の移動
	D3DXVECTOR3 pos = pTarget1->GetPos() + m_moveTarget;
	pTarget1->SetPos(pos);
}

//=============================================================================
// ポリゴンの描画
// Author : 唐﨑結斗
// 概要 : 2Dポリゴンの描画を行う
//=============================================================================
void CTwinCircle::Draw()
{

}

//=============================================================================
// 位置のセッター
// Author : 唐﨑結斗
// 概要 : 位置のメンバ変数に引数を代入
//=============================================================================
void CTwinCircle::SetPos(const D3DXVECTOR3 &pos)
{
	// 配置の初期設定
	m_pos = pos;			// 位置

	// ターゲットオブジェクトの設定
	pTarget1->SetPos(m_pos);

	// 振り子オブジェクトの設定
	pTarget1->SetPos(m_pos);
}

//=============================================================================
// 向きのセッター
// Author : 唐﨑結斗
// 概要 : 向きのメンバ変数に引数を代入
//=============================================================================
void CTwinCircle::SetRot(const D3DXVECTOR3 &rot)
{
	// 配置の初期設定
	m_rot = rot;				// 向き

	// ターゲットオブジェクトの設定
	pTarget1->SetPos(m_rot);

	// 振り子オブジェクトの設定
	pTarget1->SetPos(m_rot);
}

//=============================================================================
// 大きさのセッター
// Author : 唐﨑結斗
// 概要 : 大きさのメンバ変数に引数を代入
//=============================================================================
void CTwinCircle::SetSize(const D3DXVECTOR3 & size)
{
	// 配置の初期設定
	m_size = size;				// サイズ

	// ターゲットオブジェクトの設定
	pTarget1->SetSize(m_size);

	// 振り子オブジェクトの設定
	pTarget1->SetSize(m_size);
}